app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY id ASC
---
  def index
    @books = Book.all.order("id ASC")

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a;lfv"], ["body", "a;dfoibh@osdfb"], ["created_at", "2021-07-01 06:52:23.496711"], ["updated_at", "2021-07-01 06:52:23.496711"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    if @book.save

      flash[:notice]= 'Book was successfully created.'
      redirect_to book_path(@book)
    else

      @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @newbook = Book.new
    @book = Book.find(params[:id])

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "ce38a"], ["body", "rflh6dx5z2d895iyex85"], ["updated_at", "2021-07-01 14:06:25.398576"], ["id", 1]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
---
  def destroy
  @book = Book.find(params[:id])
    if @book.destroy